#ifndef OP2PLAYER_WIP_H
#define OP2PLAYER_WIP_H

#pragma pack(push,1)

struct OP2Player_WIP
{
  int _unknown0; // 00
  int _unknown1; // 04
  int _unknown2; // 08
  int _unknown3; // 0c
  int _unknown4; // 10
  int _unknown5; // 14
  int _unknown6; // 18
  int _unknown7; // 1c
  int _unknown8; // 20
  int _unknown9; // 24
  int _unknown10; // 28
  int _unknown11; // 2c
  int _unknown12; // 30
  int _unknown13; // 34
  int _unknown14; // 38
  int _unknown15; // 3c
  int _unknown16; // 40
  int _unknown17; // 44
  int _unknown18; // 48
  int _unknown19; // 4c
  int _unknown20; // 50
  int _unknown21; // 54
  int _unknown22; // 58
  int _unknown23; // 5c
  int _unknown24; // 60
  int _unknown25; // 64
  int _unknown26; // 68
  int _unknown27; // 6c
  int _unknown28; // 70
  int _unknown29; // 74
  int _unknown30; // 78
  int _unknown31; // 7c
  int _unknown32; // 80
  int _unknown33; // 84
  int _unknown34; // 88
  int _unknown35; // 8c
  int _unknown36; // 90
  int _unknown37; // 94
  int _unknown38; // 98
  int _unknown39; // 9c
  int _unknown40; // a0
  int _unknown41; // a4
  int _unknown42; // a8
  int _unknown43; // ac
  int _unknown44; // b0
  int _unknown45; // b4
  int _unknown46; // b8
  int _unknown47; // bc
  int _unknown48; // c0
  int _unknown49; // c4
  int _unknown50; // c8
  int _unknown51; // cc
  int _unknown52; // d0
  int _unknown53; // d4
  int _unknown54; // d8
  int _unknown55; // dc
  int _unknown56; // e0
  int _unknown57; // e4
  int _unknown58; // e8
  int _unknown59; // ec
  int _unknown60; // f0
  int _unknown61; // f4
  int _unknown62; // f8
  int _unknown63; // fc
  int _unknown64; // 100
  int _unknown65; // 104
  int _unknown66; // 108
  int _unknown67; // 10c
  int _unknown68; // 110
  int _unknown69; // 114
  int _unknown70; // 118
  int _unknown71; // 11c
  int _unknown72; // 120
  int _unknown73; // 124
  int _unknown74; // 128
  int _unknown75; // 12c
  int _unknown76; // 130
  int _unknown77; // 134
  int _unknown78; // 138
  int _unknown79; // 13c
  int _unknown80; // 140
  int _unknown81; // 144
  int _unknown82; // 148
  int _unknown83; // 14c
  int _unknown84; // 150
  int _unknown85; // 154
  int _unknown86; // 158
  int _unknown87; // 15c
  int _unknown88; // 160
  int _unknown89; // 164
  int _unknown90; // 168
  int _unknown91; // 16c
  int _unknown92; // 170
  int _unknown93; // 174
  int _unknown94; // 178
  int _unknown95; // 17c
  int _unknown96; // 180
  int _unknown97; // 184
  int _unknown98; // 188
  int _unknown99; // 18c
  int _unknown100; // 190
  int _unknown101; // 194
  int _unknown102; // 198
  int _unknown103; // 19c
  int _unknown104; // 1a0
  int _unknown105; // 1a4
  int _unknown106; // 1a8
  int _unknown107; // 1ac
  int _unknown108; // 1b0
  int _unknown109; // 1b4
  int _unknown110; // 1b8
  int _unknown111; // 1bc
  int _unknown112; // 1c0
  int _unknown113; // 1c4
  int _unknown114; // 1c8
  int _unknown115; // 1cc
  int _unknown116; // 1d0
  int _unknown117; // 1d4
  int _unknown118; // 1d8
  int _unknown119; // 1dc
  int _unknown120; // 1e0
  int _unknown121; // 1e4
  int _unknown122; // 1e8
  int _unknown123; // 1ec
  int _unknown124; // 1f0
  int _unknown125; // 1f4
  int _unknown126; // 1f8
  int _unknown127; // 1fc
  int _unknown128; // 200
  int _unknown129; // 204
  int _unknown130; // 208
  int _unknown131; // 20c
  int _unknown132; // 210
  int _unknown133; // 214
  int _unknown134; // 218
  int _unknown135; // 21c
  int _unknown136; // 220
  int _unknown137; // 224
  int _unknown138; // 228
  int _unknown139; // 22c
  int _unknown140; // 230
  int _unknown141; // 234
  int _unknown142; // 238
  int _unknown143; // 23c
  int _unknown144; // 240
  int _unknown145; // 244
  int _unknown146; // 248
  int _unknown147; // 24c
  int _unknown148; // 250
  int _unknown149; // 254
  int _unknown150; // 258
  int _unknown151; // 25c
  int _unknown152; // 260
  int _unknown153; // 264
  int _unknown154; // 268
  int _unknown155; // 26c
  int _unknown156; // 270
  int _unknown157; // 274
  int _unknown158; // 278
  int _unknown159; // 27c
  int _unknown160; // 280
  int _unknown161; // 284
  int _unknown162; // 288
  int _unknown163; // 28c
  int _unknown164; // 290
  int _unknown165; // 294
  int _unknown166; // 298
  int _unknown167; // 29c
  int _unknown168; // 2a0
  int _unknown169; // 2a4
  int _unknown170; // 2a8
  int _unknown171; // 2ac
  int _unknown172; // 2b0
  int _unknown173; // 2b4
  int _unknown174; // 2b8
  int _unknown175; // 2bc
  int _unknown176; // 2c0
  int _unknown177; // 2c4
  int _unknown178; // 2c8
  int _unknown179; // 2cc
  int _unknown180; // 2d0
  int _unknown181; // 2d4
  int _unknown182; // 2d8
  int _unknown183; // 2dc
  int _unknown184; // 2e0
  int _unknown185; // 2e4
  int _unknown186; // 2e8
  int _unknown187; // 2ec
  int _unknown188; // 2f0
  int _unknown189; // 2f4
  int _unknown190; // 2f8
  int _unknown191; // 2fc
  int _unknown192; // 300
  int _unknown193; // 304
  int _unknown194; // 308
  int _unknown195; // 30c
  int _unknown196; // 310
  int _unknown197; // 314
  int _unknown198; // 318
  int _unknown199; // 31c
  int _unknown200; // 320
  int _unknown201; // 324
  int _unknown202; // 328
  int _unknown203; // 32c
  int _unknown204; // 330
  int _unknown205; // 334
  int _unknown206; // 338
  int _unknown207; // 33c
  int _unknown208; // 340
  int _unknown209; // 344
  int _unknown210; // 348
  int _unknown211; // 34c
  int _unknown212; // 350
  int _unknown213; // 354
  int _unknown214; // 358
  int _unknown215; // 35c
  int _unknown216; // 360
  int _unknown217; // 364
  int _unknown218; // 368
  int _unknown219; // 36c
  int _unknown220; // 370
  int _unknown221; // 374
  int _unknown222; // 378
  int _unknown223; // 37c
  int _unknown224; // 380
  int _unknown225; // 384
  int _unknown226; // 388
  int _unknown227; // 38c
  int _unknown228; // 390
  int _unknown229; // 394
  int _unknown230; // 398
  int _unknown231; // 39c
  int _unknown232; // 3a0
  int _unknown233; // 3a4
  int _unknown234; // 3a8
  int _unknown235; // 3ac
  int _unknown236; // 3b0
  int _unknown237; // 3b4
  int _unknown238; // 3b8
  int _unknown239; // 3bc
  int _unknown240; // 3c0
  int _unknown241; // 3c4
  int _unknown242; // 3c8
  int _unknown243; // 3cc
  int _unknown244; // 3d0
  int _unknown245; // 3d4
  int _unknown246; // 3d8
  int _unknown247; // 3dc
  int _unknown248; // 3e0
  int _unknown249; // 3e4
  int _unknown250; // 3e8
  int _unknown251; // 3ec
  int _unknown252; // 3f0
  int _unknown253; // 3f4
  int _unknown254; // 3f8
  int _unknown255; // 3fc
  int _unknown256; // 400
  int _unknown257; // 404
  int _unknown258; // 408
  int _unknown259; // 40c
  int _unknown260; // 410
  int _unknown261; // 414
  int _unknown262; // 418
  int _unknown263; // 41c
  int _unknown264; // 420
  int _unknown265; // 424
  int _unknown266; // 428
  int _unknown267; // 42c
  int _unknown268; // 430
  int _unknown269; // 434
  int _unknown270; // 438
  int _unknown271; // 43c
  int _unknown272; // 440
  int _unknown273; // 444
  int _unknown274; // 448
  int _unknown275; // 44c
  int _unknown276; // 450
  int _unknown277; // 454
  int _unknown278; // 458
  int _unknown279; // 45c
  int _unknown280; // 460
  int _unknown281; // 464
  int _unknown282; // 468
  int _unknown283; // 46c
  int _unknown284; // 470
  int _unknown285; // 474
  int _unknown286; // 478
  int _unknown287; // 47c
  int _unknown288; // 480
  int _unknown289; // 484
  int _unknown290; // 488
  int _unknown291; // 48c
  int _unknown292; // 490
  int _unknown293; // 494
  int _unknown294; // 498
  int _unknown295; // 49c
  int _unknown296; // 4a0
  int _unknown297; // 4a4
  int _unknown298; // 4a8
  int _unknown299; // 4ac
  int _unknown300; // 4b0
  int _unknown301; // 4b4
  int _unknown302; // 4b8
  int _unknown303; // 4bc
  int _unknown304; // 4c0
  int _unknown305; // 4c4
  int _unknown306; // 4c8
  int _unknown307; // 4cc
  int _unknown308; // 4d0
  int _unknown309; // 4d4
  int _unknown310; // 4d8
  int _unknown311; // 4dc
  int _unknown312; // 4e0
  int _unknown313; // 4e4
  int _unknown314; // 4e8
  int _unknown315; // 4ec
  int _unknown316; // 4f0
  int _unknown317; // 4f4
  int _unknown318; // 4f8
  int _unknown319; // 4fc
  int _unknown320; // 500
  int _unknown321; // 504
  int _unknown322; // 508
  int _unknown323; // 50c
  int _unknown324; // 510
  int _unknown325; // 514
  int _unknown326; // 518
  int _unknown327; // 51c
  int _unknown328; // 520
  int _unknown329; // 524
  int _unknown330; // 528
  int _unknown331; // 52c
  int _unknown332; // 530
  int _unknown333; // 534
  int _unknown334; // 538
  int _unknown335; // 53c
  int _unknown336; // 540
  int _unknown337; // 544
  int _unknown338; // 548
  int _unknown339; // 54c
  int _unknown340; // 550
  int _unknown341; // 554
  int _unknown342; // 558
  int _unknown343; // 55c
  int _unknown344; // 560
  int _unknown345; // 564
  int _unknown346; // 568
  int _unknown347; // 56c
  int _unknown348; // 570
  int _unknown349; // 574
  int _unknown350; // 578
  int _unknown351; // 57c
  int _unknown352; // 580
  int _unknown353; // 584
  int _unknown354; // 588
  int _unknown355; // 58c
  int _unknown356; // 590
  int _unknown357; // 594
  int _unknown358; // 598
  int _unknown359; // 59c
  int _unknown360; // 5a0
  int _unknown361; // 5a4
  int _unknown362; // 5a8
  int _unknown363; // 5ac
  int _unknown364; // 5b0
  int _unknown365; // 5b4
  int _unknown366; // 5b8
  int _unknown367; // 5bc
  int _unknown368; // 5c0
  int _unknown369; // 5c4
  int _unknown370; // 5c8
  int _unknown371; // 5cc
  int _unknown372; // 5d0
  int _unknown373; // 5d4
  int _unknown374; // 5d8
  int _unknown375; // 5dc
  int _unknown376; // 5e0
  int _unknown377; // 5e4
  int _unknown378; // 5e8
  int _unknown379; // 5ec
  int _unknown380; // 5f0
  int _unknown381; // 5f4
  int _unknown382; // 5f8
  int _unknown383; // 5fc
  int _unknown384; // 600
  int _unknown385; // 604
  int _unknown386; // 608
  int _unknown387; // 60c
  int _unknown388; // 610
  int _unknown389; // 614
  int _unknown390; // 618
  int _unknown391; // 61c
  int _unknown392; // 620
  int _unknown393; // 624
  int _unknown394; // 628
  int _unknown395; // 62c
  int _unknown396; // 630
  int _unknown397; // 634
  int _unknown398; // 638
  int _unknown399; // 63c
  int _unknown400; // 640
  int _unknown401; // 644
  int _unknown402; // 648
  int _unknown403; // 64c
  int _unknown404; // 650
  int _unknown405; // 654
  int _unknown406; // 658
  int _unknown407; // 65c
  int _unknown408; // 660
  int _unknown409; // 664
  int _unknown410; // 668
  int _unknown411; // 66c
  int _unknown412; // 670
  int _unknown413; // 674
  int _unknown414; // 678
  int _unknown415; // 67c
  int _unknown416; // 680
  int _unknown417; // 684
  int _unknown418; // 688
  int _unknown419; // 68c
  int _unknown420; // 690
  int _unknown421; // 694
  int _unknown422; // 698
  int _unknown423; // 69c
  int _unknown424; // 6a0
  int _unknown425; // 6a4
  int _unknown426; // 6a8
  int _unknown427; // 6ac
  int _unknown428; // 6b0
  int _unknown429; // 6b4
  int _unknown430; // 6b8
  int _unknown431; // 6bc
  int _unknown432; // 6c0
  int _unknown433; // 6c4
  int _unknown434; // 6c8
  int _unknown435; // 6cc
  int _unknown436; // 6d0
  int _unknown437; // 6d4
  int _unknown438; // 6d8
  int _unknown439; // 6dc
  int _unknown440; // 6e0
  int _unknown441; // 6e4
  int _unknown442; // 6e8
  int _unknown443; // 6ec
  int _unknown444; // 6f0
  int _unknown445; // 6f4
  int _unknown446; // 6f8
  int _unknown447; // 6fc
  int _unknown448; // 700
  int _unknown449; // 704
  int _unknown450; // 708
  int _unknown451; // 70c
  int _unknown452; // 710
  int _unknown453; // 714
  int _unknown454; // 718
  int _unknown455; // 71c
  int _unknown456; // 720
  int _unknown457; // 724
  int _unknown458; // 728
  int _unknown459; // 72c
  int _unknown460; // 730
  int _unknown461; // 734
  int _unknown462; // 738
  int _unknown463; // 73c
  int _unknown464; // 740
  int _unknown465; // 744
  int _unknown466; // 748
  int _unknown467; // 74c
  int _unknown468; // 750
  int _unknown469; // 754
  int _unknown470; // 758
  int _unknown471; // 75c
  int _unknown472; // 760
  int _unknown473; // 764
  int _unknown474; // 768
  int _unknown475; // 76c
  int _unknown476; // 770
  int _unknown477; // 774
  int _unknown478; // 778
  int _unknown479; // 77c
  int _unknown480; // 780
  int _unknown481; // 784
  int _unknown482; // 788
  int _unknown483; // 78c
  int _unknown484; // 790
  int _unknown485; // 794
  int _unknown486; // 798
  int _unknown487; // 79c
  int _unknown488; // 7a0
  int _unknown489; // 7a4
  int _unknown490; // 7a8
  int _unknown491; // 7ac
  int _unknown492; // 7b0
  int _unknown493; // 7b4
  int _unknown494; // 7b8
  int _unknown495; // 7bc
  int _unknown496; // 7c0
  int _unknown497; // 7c4
  int _unknown498; // 7c8
  int _unknown499; // 7cc
  int _unknown500; // 7d0
  int _unknown501; // 7d4
  int _unknown502; // 7d8
  int _unknown503; // 7dc
  int _unknown504; // 7e0
  int _unknown505; // 7e4
  int _unknown506; // 7e8
  int _unknown507; // 7ec
  int _unknown508; // 7f0
  int _unknown509; // 7f4
  int _unknown510; // 7f8
  int _unknown511; // 7fc
  int _unknown512; // 800
  int _unknown513; // 804
  int _unknown514; // 808
  int _unknown515; // 80c
  int _unknown516; // 810
  int _unknown517; // 814
  int _unknown518; // 818
  int _unknown519; // 81c
  int _unknown520; // 820
  int _unknown521; // 824
  int _unknown522; // 828
  int _unknown523; // 82c
  int _unknown524; // 830
  int _unknown525; // 834
  int _unknown526; // 838
  int _unknown527; // 83c
  int _unknown528; // 840
  int _unknown529; // 844
  int _unknown530; // 848
  int _unknown531; // 84c
  int _unknown532; // 850
  int _unknown533; // 854
  int _unknown534; // 858
  int _unknown535; // 85c
  int _unknown536; // 860
  int _unknown537; // 864
  int _unknown538; // 868
  int _unknown539; // 86c
  int _unknown540; // 870
  int _unknown541; // 874
  int _unknown542; // 878
  int _unknown543; // 87c
  int _unknown544; // 880
  int _unknown545; // 884
  int _unknown546; // 888
  int _unknown547; // 88c
  int _unknown548; // 890
  int _unknown549; // 894
  int _unknown550; // 898
  int _unknown551; // 89c
  int _unknown552; // 8a0
  int _unknown553; // 8a4
  int _unknown554; // 8a8
  int _unknown555; // 8ac
  int _unknown556; // 8b0
  int _unknown557; // 8b4
  int _unknown558; // 8b8
  int _unknown559; // 8bc
  int _unknown560; // 8c0
  int _unknown561; // 8c4
  int _unknown562; // 8c8
  int _unknown563; // 8cc
  int _unknown564; // 8d0
  int _unknown565; // 8d4
  int _unknown566; // 8d8
  int _unknown567; // 8dc
  int _unknown568; // 8e0
  int _unknown569; // 8e4
  int _unknown570; // 8e8
  int _unknown571; // 8ec
  int _unknown572; // 8f0
  int _unknown573; // 8f4
  int _unknown574; // 8f8
  int _unknown575; // 8fc
  int _unknown576; // 900
  int _unknown577; // 904
  int _unknown578; // 908
  int _unknown579; // 90c
  int _unknown580; // 910
  int _unknown581; // 914
  int _unknown582; // 918
  int _unknown583; // 91c
  int _unknown584; // 920
  int _unknown585; // 924
  int _unknown586; // 928
  int _unknown587; // 92c
  int _unknown588; // 930
  int _unknown589; // 934
  int _unknown590; // 938
  int _unknown591; // 93c
  int _unknown592; // 940
  int _unknown593; // 944
  int _unknown594; // 948
  int _unknown595; // 94c
  int _unknown596; // 950
  int _unknown597; // 954
  int _unknown598; // 958
  int _unknown599; // 95c
  int _unknown600; // 960
  int _unknown601; // 964
  int _unknown602; // 968
  int _unknown603; // 96c
  int _unknown604; // 970
  int _unknown605; // 974
  int _unknown606; // 978
  int _unknown607; // 97c
  int _unknown608; // 980
  int _unknown609; // 984
  int _unknown610; // 988
  int _unknown611; // 98c
  int _unknown612; // 990
  int _unknown613; // 994
  int _unknown614; // 998
  int _unknown615; // 99c
  int _unknown616; // 9a0
  int _unknown617; // 9a4
  int _unknown618; // 9a8
  int _unknown619; // 9ac
  int _unknown620; // 9b0
  int _unknown621; // 9b4
  int _unknown622; // 9b8
  int _unknown623; // 9bc
  int _unknown624; // 9c0
  int _unknown625; // 9c4
  int _unknown626; // 9c8
  int _unknown627; // 9cc
  int _unknown628; // 9d0
  int _unknown629; // 9d4
  int _unknown630; // 9d8
  int _unknown631; // 9dc
  int _unknown632; // 9e0
  int _unknown633; // 9e4
  int _unknown634; // 9e8
  int _unknown635; // 9ec
  int _unknown636; // 9f0
  int _unknown637; // 9f4
  int _unknown638; // 9f8
  int _unknown639; // 9fc
  int _unknown640; // a00
  int _unknown641; // a04
  int _unknown642; // a08
  int _unknown643; // a0c
  int _unknown644; // a10
  int _unknown645; // a14
  int _unknown646; // a18
  int _unknown647; // a1c
  int _unknown648; // a20
  int _unknown649; // a24
  int _unknown650; // a28
  int _unknown651; // a2c
  int _unknown652; // a30
  int _unknown653; // a34
  int _unknown654; // a38
  int _unknown655; // a3c
  int _unknown656; // a40
  int _unknown657; // a44
  int _unknown658; // a48
  int _unknown659; // a4c
  int _unknown660; // a50
  int _unknown661; // a54
  int _unknown662; // a58
  int _unknown663; // a5c
  int _unknown664; // a60
  int _unknown665; // a64
  int _unknown666; // a68
  int _unknown667; // a6c
  int _unknown668; // a70
  int _unknown669; // a74
  int _unknown670; // a78
  int _unknown671; // a7c
  int _unknown672; // a80
  int _unknown673; // a84
  int _unknown674; // a88
  int _unknown675; // a8c
  int _unknown676; // a90
  int _unknown677; // a94
  int _unknown678; // a98
  int _unknown679; // a9c
  int _unknown680; // aa0
  int _unknown681; // aa4
  int _unknown682; // aa8
  int _unknown683; // aac
  int _unknown684; // ab0
  int _unknown685; // ab4
  int _unknown686; // ab8
  int _unknown687; // abc
  int _unknown688; // ac0
  int _unknown689; // ac4
  int _unknown690; // ac8
  int _unknown691; // acc
  int _unknown692; // ad0
  int _unknown693; // ad4
  int _unknown694; // ad8
  int _unknown695; // adc
  int _unknown696; // ae0
  int _unknown697; // ae4
  int _unknown698; // ae8
  int _unknown699; // aec
  int _unknown700; // af0
  int _unknown701; // af4
  int _unknown702; // af8
  int _unknown703; // afc
  int _unknown704; // b00
  int _unknown705; // b04
  int _unknown706; // b08
  int _unknown707; // b0c
  int _unknown708; // b10
  int _unknown709; // b14
  int _unknown710; // b18
  int _unknown711; // b1c
  int _unknown712; // b20
  int _unknown713; // b24
  int _unknown714; // b28
  int _unknown715; // b2c
  int _unknown716; // b30
  int _unknown717; // b34
  int _unknown718; // b38
  int _unknown719; // b3c
  int _unknown720; // b40
  int _unknown721; // b44
  int _unknown722; // b48
  int _unknown723; // b4c
  int _unknown724; // b50
  int _unknown725; // b54
  int _unknown726; // b58
  int _unknown727; // b5c
  int _unknown728; // b60
  int _unknown729; // b64
  int _unknown730; // b68
  int _unknown731; // b6c
  int _unknown732; // b70
  int _unknown733; // b74
  int _unknown734; // b78
  int _unknown735; // b7c
  int _unknown736; // b80
  int _unknown737; // b84
  int _unknown738; // b88
  int _unknown739; // b8c
  int _unknown740; // b90
  int _unknown741; // b94
  int _unknown742; // b98
  int _unknown743; // b9c
  int _unknown744; // ba0
  int _unknown745; // ba4
  int _unknown746; // ba8
  int _unknown747; // bac
  int _unknown748; // bb0
  int _unknown749; // bb4
  int _unknown750; // bb8
  int _unknown751; // bbc
  int _unknown752; // bc0
  int _unknown753; // bc4
  int _unknown754; // bc8
  int _unknown755; // bcc
  int _unknown756; // bd0
  int _unknown757; // bd4
  int _unknown758; // bd8
  int _unknown759; // bdc
  int _unknown760; // be0
  int _unknown761; // be4
  int _unknown762; // be8
  int _unknown763; // bec
  int _unknown764; // bf0
  int _unknown765; // bf4
  int _unknown766; // bf8
  int _unknown767; // bfc
  int _unknown768; // c00
  int _unknown769; // c04
  int _unknown770; // c08
  int _unknown771; // c0c
  int _unknown772; // c10
  int _unknown773; // c14
  int _unknown774; // c18
  int _unknown775; // c1c
  int _unknown776; // c20
};

#pragma pack(pop)

#endif